Revit 2027 API
UnitUtils.GetAllMeasurableSpecs Method
 Gets the identifiers of all available measurable specs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ForgeTypeId> GetAllMeasurableSpecs()
Public Shared Function GetAllMeasurableSpecs As IList(Of ForgeTypeId)
public:
static IList<ForgeTypeId^>^ GetAllMeasurableSpecs()
static member GetAllMeasurableSpecs : unit -> IList<ForgeTypeId>
Return Value
IList<ForgeTypeId>
 The spec identifiers.
See Also
Reference
UnitUtils Class
Autodesk.Revit.DB Namespace